
&НаСервере
Процедура УстановитьОтборВерсий(ТекущийОбъект)
	
	ПолеВладелец = Новый ПолеКомпоновкиДанных("Владелец");
	
	Отборы = Версии.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	ЭлементОтбора = Неопределено;
	Для каждого эл из Отборы Цикл
		Если эл.ЛевоеЗначение = ПолеВладелец Тогда
			ЭлементОтбора = эл;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Отборы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = ПолеВладелец;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	ЭлементОтбора.ПравоеЗначение = ТекущийОбъект.Ссылка;
	
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборВерсий(Объект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьОтборВерсий(ТекущийОбъект);
КонецПроцедуры
