Функция ПреобразоватьСтрокуВHTML(Знач Строка) экспорт
	
	Префиксы = ПолучитьПрефиксы();
	Разделители = ПолучитьРазделители();
	
	Строка = ЭкранироватьТекстВHTML(Строка);
	
 	ВремСтрока = "";
	Пока Истина Цикл
		
		Результат = НайтиПрефикс(Префиксы,Строка);
		Если Результат = Неопределено Тогда
			Позиция = 0;
		Иначе
			Позиция = Результат.Позиция;
		КонецЕсли;	
		
		Если Позиция > 0 Тогда
			ВремСтрока =  ВремСтрока + Лев(Строка, Позиция-1);
			URL = Результат.Префикс;
			ВремСтрока = ВремСтрока + "<A href="""+Результат.Префикс;
			Строка = Сред(Строка,Позиция+СтрДлина(Результат.Префикс));
			
			ПозицияРазделителя = Найти(Строка," ");
			
			РезультатРазделителей = НайтиПрефикс(Разделители,Строка);
			Если РезультатРазделителей = Неопределено Тогда
 				ПозицияРазделителя = 0;
			Иначе
				ПозицияРазделителя = РезультатРазделителей.Позиция;
			КонецЕсли;	
			
			Если ПозицияРазделителя > 0 Тогда
				ЧастьURL = Лев(Строка, ПозицияРазделителя-1);
				URL = URL + ЧастьURL;
				ВремСтрока =  ВремСтрока + ЧастьURL;
				ВремСтрока =  ВремСтрока + """>"+URL+"</A>";
				Строка = Сред(Строка,ПозицияРазделителя);
			Иначе
				ВремСтрока =  ВремСтрока + Строка+ """>"+URL+Строка+"</A>";
				Прервать;
			КонецЕсли;
		Иначе
			ВремСтрока =  ВремСтрока + Строка;
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;	
	
	ВремСтрока = СтрЗаменить(ВремСтрока,Символы.ПС,"<br>");
	Возврат  ВремСтрока;
	
КонецФункции

Функция ПолучитьПрефиксы()
	
	Префиксы = Новый ТаблицаЗначений;
	Префиксы.Колонки.Добавить("Префикс");
	Префиксы.Колонки.Добавить("Позиция");
	
	НоваяСтрока = Префиксы.Добавить();
	НоваяСтрока.Префикс = "https://";
	НоваяСтрока = Префиксы.Добавить();
	НоваяСтрока.Префикс = "http://";
	НоваяСтрока = Префиксы.Добавить();
	НоваяСтрока.Префикс = "e1cib/";
	НоваяСтрока = Префиксы.Добавить();
	НоваяСтрока.Префикс = "e1c://";

    Возврат Префиксы;
	
КонецФункции	

Функция ПолучитьРазделители()
	
	Префиксы = Новый ТаблицаЗначений;
	Префиксы.Колонки.Добавить("Префикс");
	Префиксы.Колонки.Добавить("Позиция");
	
	НоваяСтрока = Префиксы.Добавить();
	НоваяСтрока.Префикс = " ";
	НоваяСтрока = Префиксы.Добавить();
	НоваяСтрока.Префикс = ";";
	НоваяСтрока = Префиксы.Добавить();
	НоваяСтрока.Префикс = ",";
	НоваяСтрока = Префиксы.Добавить();
	НоваяСтрока.Префикс = Символы.ПС;
	
    Возврат Префиксы;
	
	
КонецФункции

Функция ЭкранироватьТекстВHTML(Стр)
	
	Стр = СтрЗаменить(Стр,"<","&lt");
	Стр = СтрЗаменить(Стр,">","&gt");
	Стр = СтрЗаменить(Стр,"""","&quot");
    
	Возврат стр;
	
КонецФункции

Функция НайтиПрефикс(Префиксы,Строка)
	
	Для каждого ТекСтрока из Префиксы Цикл
		Позиция = Найти(Строка,ТекСтрока.Префикс);
		ТекСтрока.Позиция = Позиция;
	КонецЦикла;
	Префиксы.Сортировать("Позиция");
	Для каждого ТекСтрока из Префиксы Цикл
		Если ТекСтрока.Позиция > 0 Тогда
			Возврат ТекСтрока;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Неопределено;
КонецФункции	

Функция УдалитьНедопустимыеСимволы(стрОписание) экспорт
	Результат = "";
	Позиция = 1;
	Пока Истина Цикл
		ПозицияНовая = НайтиНедопустимыеСимволыXML(стрОписание,Позиция);
		Если ПозицияНовая = 0 Тогда
			//в строке нет недопустимых символов
			Результат = Результат + Сред(стрОписание,Позиция);
			Прервать;
		КонецЕсли;	
		Если ПозицияНовая = Позиция Тогда
			Позиция = Позиция + 1;
			Продолжить;
		КонецЕсли;
		Результат = Результат + Сред(стрОписание,Позиция,ПозицияНовая-Позиция);
		Позиция = ПозицияНовая + 1;
	КонецЦикла;
	Возврат Результат;
КонецФункции