&НаСервереБезКонтекста
Функция ТекстПолучитьИтоги()
	
	Возврат УправлениеТестированием.КоличествоЭлементовВГруппе("СценарииТестирования");
	
КонецФункции	


&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	мсв = Новый Массив;
	Для каждого текСтрока из Строки Цикл
		мсв.Добавить(текСтрока.Ключ);
	КонецЦикла;	
	
	Запрос  = Новый Запрос(ТекстПолучитьИтоги());
	Запрос.УстановитьПараметр("Группы",мсв);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаСписка = Строки.Получить(Выборка.Ссылка);
		СтрокаСписка.Данные.Количество = Выборка.Кол;
		
	КонецЦикла;	
	
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция СписокПриАктивизацииСтрокиНаСервере(Сценарий)
	
	Если ЗначениеЗаполнено(Сценарий) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий,"ЭтоГруппа")=Ложь Тогда
		ПоследняяВерсия = Справочники.СценарииТестирования.ПоследняяВерсия(Сценарий);
		Если ЗначениеЗаполнено(ПоследняяВерсия) Тогда
			Возврат Справочники.СценарииТестирования.ПредставлениеСценария(ПоследняяВерсия);
		Иначе
			Возврат "";
		КонецЕсли;	
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПредставлениеТеста = СписокПриАктивизацииСтрокиНаСервере(Элементы.Список.ТекущаяСтрока);
КонецПроцедуры